{
  "rabbana_duas": [
    {
      "category": {
        "en": "Rabbana Duas",
        "ar": "أدعية ربنا",
        "hi": "रब्बना दुआएं"
      },
      "duas": [
        {
          "id": 1,
          "surah": "Al-Baqarah",
          "verse": 127,
          "title": {
            "en": "Rabbana Taqabbal - Acceptance Dua",
            "ar": "ربنا تقبل - دعاء القبول",
            "hi": "रब्बना तकब्बल - स्वीकृति की दुआ"
          },
          "arabic": "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ العَلِيمُ",
          "transliteration": {
            "en": "Rabbana taqabbal minna innaka antas Sameeaul Aleem",
            "ar": "ربنا تقبل منا إنك أنت السميع العليم",
            "hi": "रब्बना तकब्बल मिन्ना इन्नका अंतस समीउल अलीम"
          },
          "translation": {
            "en": "Our Lord! Accept (this service) from us: For Thou art the All-Hearing, the All-knowing.",
            "ar": "ربنا تقبل منا إنك أنت السميع العليم.",
            "hi": "हे हमारे रब! हमसे (यह सेवा) स्वीकार कर: क्योंकि तू सब कुछ सुनने वाला, सब कुछ जानने वाला है।"
          },
          "reference": ""
        },
        {
          "id": 2,
          "surah": "Al-Baqarah",
          "verse": 128,
          "title": {
            "en": "Rabbana Make us Muslims",
            "ar": "ربنا واجعلنا مسلمين",
            "hi": "रब्बना हमें मुसलमान बनाएं"
          },
          "arabic": "رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ",
          "transliteration": {
            "en": "Rabbana wa-j'alna Muslimayni laka wa min Dhurriyatina 'Ummatan Muslimatan laka wa 'Arina Manasikana wa tub 'alayna 'innaka 'antat-Tawwabu-Raheem",
            "ar": "ربنا واجعلنا مسلمين لك ومن ذريتنا أمة مسلمة لك وأرنا مناسكنا وتب علينا إنك أنت التواب الرحيم",
            "hi": "रब्बना व-ज'अलना मुस्लिमय्नी लका व मिन ज़ुर्रियतिना उम्मतन मुस्लिमतन लका व अरिना मनासिकना व तुब अलैना इन्नका अंतत-तव्वाब-रहीम"
          },
          "translation": {
            "en": "Our Lord! Make of us Muslims, bowing to Thy (Will), and of our progeny a people Muslim, bowing to Thy (will); and show us our place for the celebration of (due) rites; and turn unto us (in Mercy); for Thou art the Oft-Returning, Most Merciful.",
            "ar": "ربنا اجعلنا مسلمين لك ومن ذريتنا أمة مسلمة لك وأرنا مناسكنا وتب علينا إنك أنت التواب الرحيم.",
            "hi": "हे हमारे रब! हमें अपने प्रति समर्पित मुसलमान बना दे और हमारी संतान से भी एक मुस्लिम समुदाय बना दे, हमें हमारी इबादत के तरीके बता दे और हमारी तौबा कुबूल कर, निश्चय ही तू ही तौबा कुबूल करने वाला दयावान है।"
          },
          "reference": ""
        },
        {
          "id": 3,
          "surah": "Al-Baqarah",
          "verse": 201,
          "title": {
            "en": "Rabbana for Good in Both Worlds",
            "ar": "ربنا للخير في الدنيا والآخرة",
            "hi": "रब्बना दोनों जहानों में भलाई के लिए"
          },
          "arabic": "رَبَّنَآ اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَّفِي الْاٰخِرَةِ حَسَـنَةً وَّقِنَا عَذَابَ النَّارِ",
          "transliteration": {
            "en": "Rabbanaaa Aatinaa Fiddunyaa H'asanata Wa Fil Aakhirati H'asanata Wa Qinaa A'd'aaban Naar",
            "ar": "ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار",
            "hi": "रब्बना आतिना फिद्दुनया हसनतन व फिल आखिरति हसनतन व क़िना अज़ाबन नार"
          },
          "translation": {
            "en": "Our Lord! Give us in this world that which is good and in the Hereafter that which is good, and save us from the torment of the Fire!",
            "ar": "ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار.",
            "hi": "हे हमारे रब! हमें दुनिया में भलाई दे और आखिरत में भी भलाई दे, और हमें आग के अज़ाब से बचा।"
          },
          "reference": ""
        }
      ]
    }
  ]
}